[{"model": "core.blogpost", "pk": 1, "fields": {"title": "Top 20 mobile apps which nobody knows about…", "description": "In the vast ocean of mobile applications, some remarkable gems often go unnoticed. While popular apps dominate the headlines, there are numerous lesser-known apps that offer unique features, creative", "pub_date": "2023-09-28T07:01:22Z", "reading_time": 6, "content": "In the vast ocean of mobile applications, some remarkable gems often go unnoticed. While popular apps dominate the headlines, there are numerous lesser-known apps that offer unique features, creative solutions, and a refreshing experience. In this article, we’ll unveil 20 remarkable mobile apps that have flown under the radar but are worth exploring. From productivity tools to innovative entertainment options, let’s discover these hidden gems!\r\n\r\n\r\nPhoto by Roberto Nickson on Unsplash\r\n“Journo” — Your Personal Journal\r\nJourno is an intuitive and aesthetically pleasing journaling app that allows you to document your thoughts, feelings, and experiences effortlessly. With features like photo integration, voice-to-text entry, and mood tracking, Journo is your perfect companion for self-reflection.\r\n\r\n\r\n“Momento” — Digital Memory Box\r\nMemento is a unique app that helps you create and curate digital memory boxes. Preserve your cherished moments by combining photos, videos, and text in beautiful collages, ensuring your memories stay alive in a visually appealing and organized manner.\r\n\r\n\r\n“Wolfram Alpha” — Computational Knowledge Engine\r\nWolfram Alpha is an intelligent computational knowledge engine that provides answers and explanations across a vast range of subjects. From complex mathematical problems to nutritional information and historical data, this app is a must-have for knowledge seekers.\r\n\r\n\r\n“Forest” — Stay Focused and Productive Forest encourages focus and productivity by gamifying your work sessions. Plant a virtual tree and watch it grow as you resist distractions and stay on task. The app also partners with a real-tree planting organization to make a positive impact on the environment.\r\n\r\n“Slowly” — Pen-Pal App for the Digital Age\r\nSlowly revives the art of letter writing by connecting you with pen pals from around the world. Experience the joy of exchanging thoughtful, well-crafted letters, and build lasting friendships with people who share similar interests and perspectives.\r\n\r\n\r\n“Streaks” — Build Healthy Habits\r\nStreaks is a habit-tracking app that helps you establish and maintain positive routines. Set personalized goals, track your progress, and build streaks to reinforce healthy habits such as exercise, reading, meditation, and more.\r\n\r\n\r\n“Otter Voice Notes” — Effortless Transcription\r\nOtter Voice Notes is an impressive app that transcribes your spoken words in real-time. Whether you’re attending a lecture, conducting interviews, or simply brainstorming, Otter ensures you capture every word accurately.\r\n\r\n\r\n“Dark Sky” — Hyperlocal Weather Forecasts\r\nDark Sky delivers hyperlocal weather forecasts, providing minute-by-minute predictions and detailed information about upcoming weather conditions. Stay prepared and make informed decisions based on the most accurate data available.\r\n\r\n\r\n“Mimo” — Learn to Code on the Go\r\nMimo is a user-friendly coding app that offers bite-sized lessons for various programming languages. Whether you’re a beginner or want to expand your coding skills, Mimo provides an interactive and accessible learning experience.\r\n\r\n\r\n“Libby” — Digital Library at Your Fingertips\r\nLibby connects to your local library and allows you to borrow eBooks and audiobooks seamlessly. Enjoy a vast collection of literature on your mobile device, making it a paradise for book lovers.\r\n\r\n\r\n“MyNoise” — Personalized Soundscapes\r\nMyNoise offers a collection of customizable soundscapes that help you relax, concentrate, or mask unwanted noise. Whether you need a peaceful environment for meditation or a focused ambiance for work, MyNoise has you covered.\r\n\r\n\r\n“Pocket” — Save and Organize Web Content\r\nPocket allows you to save articles, videos, and web pages to read or watch later. With an intuitive interface and offline accessibility, it’s an excellent tool for curating your own personalized content library.\r\n\r\n\r\n“Sleep Cycle” — Intelligent Sleep Tracker\r\nSleep Cycle analyzes your sleep patterns and wakes you up gently during your lightest sleep phase, ensuring you feel refreshed and energized. Track your sleep quality and gain insights to improve your overall well-being.\r\n\r\n\r\n“Tunity” — Hear the Sound of Any Muted TV\r\nTunity is an ingenious app that lets you listen to the audio from any muted TV. Simply scan the TV screen, and Tunity will stream the sound directly to your mobile device, making it ideal for crowded places or muted televisions.\r\n\r\n\r\n“Forest: Stay Focused” — Promote Digital Well-being\r\nForest: Stay Focused is a digital well-being app that encourages healthy mobile phone usage habits. Plant a virtual tree, and as you resist distractions, the tree grows. The app’s charming graphics and motivation to reduce screen time make it an excellent choice.\r\n\r\n\r\n“SkyView” — Explore the Stars\r\nSkyView offers a fascinating augmented reality experience that allows you to identify stars, planets, constellations, and satellites simply by pointing your phone at the sky. Discover the wonders of the universe in a fun and educational way.", "tags": [1]}}, {"model": "core.blogpost", "pk": 2, "fields": {"title": "The 7 Signs of a Bad Programmer", "description": "Not the only ones, unfortunately — There are many ways to be ineffective at a job. Here are a few that seem to be a running theme with some programmers I’ve worked with over the years: I’m a", "pub_date": "2023-09-28T07:01:56Z", "reading_time": 4, "content": "There are many ways to be ineffective at a job. Here are a few that seem to be a running theme with some programmers I’ve worked with over the years:\r\n\r\nI’m a Software Engineer, not a Programmer\r\nYou know what they’re like. Mechanical keyboard in the office? Can’t make the standup because they were thinking about that problem (it’s 5 minutes to mention what you’re thinking). How long did it take to get the latte?\r\n\r\nI’m not entirely certain how people can become so arrogant with 3 years of experience, but there you go.\r\n\r\nI like to impress with my job title. Who? What do you mean, nobody cares.\r\n\r\nPerhaps a little more time working and a little less time working on your status?\r\n\r\nWhiteboard in the background\r\nSome people in the industry do have degrees. I’ve worked with Doctors (not the medical kind, OK). Those with qualifications in the industry often choose not to mention them, because within many organizations there is a reverse snobbishness around education.\r\n\r\nYet others wear glasses without medical reason (which really happens) and stand in front of a whiteboard on those video calls.\r\n\r\nI’d be more impressed if your whiteboard had more than a bullet-point list. That is, I know you don’t understand the wider architecture of the application. Your whiteboard is like putting make-up on a pig.\r\n\r\nZing.\r\n\r\nSome have interesting information written on that whiteboard, though.\r\n\r\nDelete the current project\r\nYou’ve entered a new project and have seen someone on Twitter recommend that you delete the whole thing and start again.\r\n\r\nWon’t the current team members be somewhat put out of joint by this suggestion? What do you mean, teamwork might be damaged?\r\n\r\nJust delete it\r\n\r\nOk, whatever.\r\n\r\nThe Michael Jackson (Black or White)", "tags": [1]}}, {"model": "core.blogpost", "pk": 3, "fields": {"title": "UI/ UX Designer — A trendy career is coming to an end?", "description": "If you read my 50 Android Studio Tips, Tricks & Resources article (over 10k 👏), you will probably find this useful as well. The idea behind this", "pub_date": "2023-09-28T07:02:36Z", "reading_time": 5, "content": "2 years ago when I was still working as a Graphic Designer, there was a UI/ UX Designer who told me that “Hey, you should move to the UI/ UX Design field, you would earn much more than this.”\r\n\r\nAt that time, I refused. I was a person having enough clear self-awareness to know that I did not follow something just simply for money. One big decision for changing career from a 4-year experienced C-Levels/ Manager Assistant to a Graphic Designer has taught me that.\r\n\r\nAt that time, I did not even know UI/ UX Design was a trendy career. I did not realize that there was something called “trendy jobs” because as a person who felt unsatisfied in my old career, as an Assistant, even in Vietnam it was a “luxurious job”, I always had a thought in my mind for several years, which was “I wanted to change to another job/ career”, so I could not imagine that people could follow a “trendy career” without a clear consideration of themselves.\r\n\r\nI just found out that I would love to follow the UX Career after I had done something like creating a website for my blog, customizing it by my ideas, designing a web landing page as requested by my freelance client, and got a chance involved in Web & Mobile Graphic Design as well as UX testing, feedback, solution suggestions for UNIQLO client, and then involved to their continuous sprints after their app was launched. Those works helped to bring me real insights into the field, and that was when I knew I wanted to follow it.\r\n\r\nThe UX career trend is dead by indigestion of the low-quality and unqualified\r\n\r\nI watched a Youtuber’s video talking about the death of UX Design hype — Wesley Hong. He was a senior UX Designer in the US but has very realistic eyes on things around him, especially in the UX field. I totally agree when he mentioned the low quality of those boot camps which have been trying to bait people to pay much money for learning to switch to UX trendy career in a short time, and always with an advertising like “100% you will get the job”.\r\n\r\nThe UX trend was raising mainly from the Covid situation, when many people lost their jobs and have to stay home for quarantine without income, and with a blurry dark visualization of life and career. At that time, those work-from-home jobs such as Designers, and Developers were very attractive with tons of videos on Youtube, Tiktok, Instagram, etc. to show their “A Day In Life”. To be honest, I saw that too, and I admired that too. :)\r\n\r\nFrom that time, many online bootcamps, from old to new ones, started to push up their study programs with fantastic advertising to attract students. Of course, there were high-quality programs, but with a high running speed to follow the trend for money, there were more and more low-quality courses made quickly. As a result, after some months, hundreds to thousands of students graduated and started to seek entry-level jobs. In those fresh days, that was still quite smooth to seek an entry-level job to change quickly, yeah it was true for the trend. However, let’s imagine until now, still, thousands bootcamps graduates plus layoffs in tech, many people found out this career is not easy to break into like before, and become miserable.\r\n\r\nI joined many Facebook community groups of UI/ UX and saw that everyday people expressed their hopeless and miserable thinking about their job-seeking for entry-level, and even mid-senior levels find it hard in this situation of tech layoffs as well. Even more miserable when I saw many people call themself UI/ UX Designers and advertised themselves for so cheap freelance pay with their portfolios including low-quality works without UX standards, and even copied works randomly online.\r\n\r\nBut there is a bright side for those who have a real passion for UX.\r\n\r\nThe entry-level labor of the UX field is really a mess now, I was worried, too, but there is one thing Wesley Hong said that motivated me a lot, that the UX Design hype is dead means those designers, who still keep staying strong and improve for better to get jobs even it is much harder, are those have a true passion with the field and would definitely be stronger and more determined to grow more.\r\n\r\nThe UX field is very wide, and those who really learn seriously would know that. On my side, every day I swim in tabs to read and learn deeper to upgrade my knowledge, and the practice is never enough. The trend is over, so, entry-level UX Designers, let’s face the truth that now it is not easy and quick for you to switch to a UX career in a couple of months anymore. However, yeah, this is a chance for you to sit back and analyze yourself if you really have passion for this field or if it was because of the trend. Ask yourself if you are ok to take critiques on your design every day from stakeholders.\r\n\r\nThe truth of the design field is that you cannot work just on your own decisions like when you worked on your personal projects or practiced with your favorite designs. The truth is your work would have to go through many considerations, get critiques from many people, and sometimes you could not persuade and need to change your work, and not everyone joins in the critique knows how to give feedback in a soft enough way to make you still feel good, really, I was in that situation. Actually, some designers I knew have shared that after a time working in the field, they think it is not for them, and they feel more and more miserable and asked for advice that if they should change to another career.\r\n\r\nSo, let’s be clear and have a real understanding of yourself first\r\n\r\nTo choose a career, you first need to understand really clearly about yourself and the field you are going to choose. There are several ways to do this, in my case, I did some personality tests and thought about what attracted me the most and what I loved to do the most when I was a kid, and spend time on reflection to analyze myself. Also, I took time to find out what a UX Designer really do at work by reaching out to experienced designers and asking about the reality in their work, not just watching some fancy life videos on Youtube or Instagram because you know, everybody usually just shows and says good things about their life on social media, not many people have enough courage to share their dark and sad side to you, random strangers. :)\r\n\r\nWays to find out about ourselves are also an art and an important mission to do in life, I believe. I might share more in another post. I hope that those fresh UI/UX Designers who really have passion for the field would keep staying strong in this hard situation of the economy. Let’s be optimistic together, keep believing, studying, and working hard to upgrade ourselves for our real passion.\r\n\r\nAt the right time, the right thing will come! :)\r\n\r\n— — —\r\n\r\nHere is the video of Wesley Hong if you would like to hear his thought: https://www.youtube.com/watch?v=SODiPcgJl_o&t=24s", "tags": [1]}}, {"model": "core.tag", "pk": 1, "fields": {"name": "Tech"}}]